Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.SelectionIncludesOptionItems
Elements that were already in a Design Option were selected.  These will not be added to the Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.OptionElementsDeleted
Elements in [option] were deleted

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NoSelectedInOption
None of the selected elements can be added to this Option Set. The following warnings provide additional information.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOptionWarn
Some types of elements can't belong to an Option.  Elements of these types were not added to this Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOption
Some types of elements can't belong to an Option.  Elements of these types were not added to this Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustBeInMainModel
Element must be in Main Model

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKingWarn
In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKing
In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOptionWarn
A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOption
A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.FabricationCannotBeInDesignOption
Structural steel connections or individual structural steel fabrication elements are not allowed in Design Options.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ElementsWillBeDeletedNoOption
Elements will be deleted

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsWarn
This is an internal diagnostic message.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.DebugLevelsInOptionsError
This is an internal diagnostic message.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModelWarn
A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModel
A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOptionWarn
A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOption
A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOptionWarn
A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOption
A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModelWarn
A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModel
A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOptionWarn
A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOption
A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOptionWarn
A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOption
A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInMainModelWarn
An insert in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInMainModel
An insert in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOptionWarn
An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOption
An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOptionWarn
An insert in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOption
An insert in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutZoneInOption
HVAC Zones must be in the Main Model.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutSpaceInOption
MEP space must be in the Main Model

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptionsWarn
Elements can't be added to Option Set

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptions
Elements can't be added to Option Set

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondaryWarn
No element in a secondary Option can be referenced by an element outside that Option.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondary
No element in a secondary Option can be referenced by an element outside that Option.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptionsWarn
An element may not reference an element in another Option of the same Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptions
An element may not reference an element in another Option of the same Option Set.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.AreaTagLineCannotBeInDesignOption
Areas and Area Boundaries are not allowed in Design Options. Make an Area Scheme and an Area Plan for this Option then draw all Areas and Area Boundaries in that view.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures
Failures about DesignOptionFailures.